       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXO3DB.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MSG-ERR.
           05 ERR-LEN  PIC S9(4) COMP VALUE +720.
           05 ERR-TXT  PIC X(72) OCCURS 10 TIMES  INDEXED BY IX-ERR.
       77 LEN-ERR-TXT  PIC S9(9) COMP VALUE +72.
           EXEC SQL
             INCLUDE SQLCA
           END-EXEC.

           EXEC SQL
             INCLUDE TEMPL
           END-EXEC.

           EXEC SQL
             INCLUDE TDEPT
           END-EXEC.

       PROCEDURE DIVISION.
       S10-INITIALISE SECTION.
           PERFORM MD01-INIT-TRT
           PERFORM MD02-TRT-01
           THRU    MD03-ERREUR
           UNTIL   SQLCODE = 100
           PERFORM MD04-FIN.
       MD01-INIT-TRT.
           IF SQLCODE < ZERO OR SQLCODE = 100
              DISPLAY " PROGRAMME EXO3DB, VERSION 1.0"
              DISPLAY " ERREUR D'OUVERTURE SQL"
              DISPLAY " CODE RETOUR " SQLCODE
              DISPLAY " PAS DE TRAITEMENT"
              PERFORM MD03-ERREUR
              GOBACK
           END-IF.
       MD02-TRT-01.

           EXEC SQL
                UPDATE TEMPL
                SET SALAIRE = (SALAIRE)*1.10
                WHERE DEPT = 'FAT'
           END-EXEC.

       MD03-ERREUR.
           IF SQLCODE < ZERO OR SQLCODE > 100
              CALL 'DSNTIAR' USING SQLCA MSG-ERR LEN-ERR-TXT
              DISPLAY MSG-ERR
              GOBACK
           END-IF.

       MD04-FIN.
           STOP RUN.
