//FORI05A JOB ACCTFORI,'JULIEN',CLASS=I,MSGCLASS=I,NOTIFY=&SYSUID       00010000
//COBBTCH EXEC ICOBBTCH,PGMB=PGMVSAM,GRPEHLQ='FORI05'                   00020002
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030000
//LKED.SYSIN DD *                                                       00040000
  ENTRY PGMVSAM                                                         00050001
  NAME  PGMVSAM(R)                                                      00060001
//SYSPRINT DD SYSOUT=*                                                  00070000
//SYSOUT DD SYSOUT=*                                                    00080000
