//FORI05A JOB ACCTFORI,'JULIEN',CLASS=I,MSGCLASS=I,NOTIFY=&SYSUID       00010099
//COBBTCH EXEC ICOBBTCH,PGMB=PROG6,GRPEHLQ='FORI05'                     00020099
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030099
//LKED.SYSIN DD *                                                       00040000
  ENTRY PROG6                                                           00050099
  NAME  PROG6(R)                                                        00060099
//SYSPRINT DD SYSOUT=*                                                  00070050
//SYSOUT DD SYSOUT=*                                                    00080050
