//FORI05A JOB ACCTFORI,'JULIEN',CLASS=I,MSGCLASS=I,NOTIFY=&SYSUID       00010000
//COBBTCH EXEC ICOBBTCH,PGMB=PROG88,GRPEHLQ='FORI05'                    00020003
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030000
//LKED.SYSIN DD *                                                       00040000
  ENTRY PROG88                                                          00050003
  NAME  PROG88(R)                                                       00060003
//SYSPRINT DD SYSOUT=*                                                  00070000
//SYSOUT DD SYSOUT=*                                                    00080000
