//FORI05A JOB ('ACCTFORI'),'JULIEN',MSGCLASS=I,CLASS=I,NOTIFY=&SYSUID   00010000
//COMPIL EXEC ICOBBTCH,PGMB=PROG8,GRPEHLQ='FORI05'                      00020001
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030000
//LKED.SYSIN DD *                                                       00040000
  ENTRY PROG8                                                           00050001
  NAME  PROG8(R)                                                        00060002
//SYSPRINT DD SYSOUT=*                                                  00070000
//SYSOUT DD SYSOUT=*                                                    00080000
