//FORI05A JOB ('ACCTFORI'),'JULIEN',MSGCLASS=I,CLASS=I,NOTIFY=&SYSUID   00010000
//COMPIL EXEC ICOBBTCH,PGMB=MONPROG4,GRPEHLQ='FORI05'                   00020002
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030000
//LKED.SYSIN DD *                                                       00040000
  ENTRY MONPROG4                                                        00050002
  NAME  MONPROG4(R)                                                     00060002
//SYSPRINT DD SYSOUT=*                                                  00070000
//SYSOUT DD SYSOUT=*                                                    00080000
