//FORI05A JOB ACCTFORI,'JULIEN',CLASS=I,MSGCLASS=I,NOTIFY=&SYSUID       00010003
//COMPIL EXEC ICOBBTCH,PGMB=MONPROG1,GRPEHLQ='FORI05'                   00020004
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030005
//LKED.SYSIN DD *                                                       00040000
  ENTRY MONPROG1                                                        00050002
  NAME  MONPROG1(R)                                                     00060006
//SYSPRINT DD SYSOUT=*                                                  00070000
//SYSOUT DD SYSOUT=*                                                    00080000
