//FORI05A JOB ('ACCTFORI'),'JULIEN',MSGCLASS=I,CLASS=I,NOTIFY=&SYSUID   00010000
//COMPIL EXEC ICOBBTCH,PGMB=PROG16,GRPEHLQ='FORI05'                     00020004
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030000
//LKED.SYSIN DD *                                                       00040000
  ENTRY PROG16                                                          00050004
  NAME  PROG16(R)                                                       00060004
//SYSPRINT DD SYSOUT=*                                                  00070000
//SYSOUT DD SYSOUT=*                                                    00080000
