//FORI05A JOB 'ACCTFORI','JULIEN',CLASS=I,MSGCLASS=I,NOTIFY=&SYSUID     00010024
//STEP1 EXEC ICOBBTCH,PGMB=TEMPLATE,GRPEHLQ='FORI05'                    00030025
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00040018
//LKED.SYIN DD *                                                        00050024
  ENTRY TEMPLATE                                                        00060021
  NAME  TEMPLATE(R)                                                     00070021
//SYSPRINT DD SYSOUT=*                                                  00080019
//SYSOUT DD SYSOUT=*                                                    00090019
