//FORI05C JOB ACCTFORI,'JULIEN',CLASS=I,MSGCLASS=I,NOTIFY=&SYSUID       00010099
//COBBTCH EXEC ICOBBTCH,PGMB=PROGKSDS,GRPEHLQ='FORI05'                  00020099
//SYSLINK DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030099
//*DDLISTE DD DSN=FORI01.SEQ.LISTE,DISP=SHR                             00040099
//LKED.SYSIN DD *                                                       00050000
  ENTRY PROGKSDS                                                        00060099
  NAME  PROGKSDS(R)                                                     00070099
//SYSPRINT DD SYSOUT=*                                                  00080099
//SYSOUT DD SYSOUT=*                                                    00090050
