//FORI05E  JOB ICCTFORI,'JULIEN',CLASS=I,MSGCLASS=I,NOTIFY=&SYSUID      00010002
//STEP1 EXEC PGM=PROG15,TIME=(0,1)                                      00020020
//STEPLIB DD DSN=FORI05.LIB.LOAD,DISP=SHR                               00030002
//SYSPRINT  DD SYSOUT=*                                                 00040002
//SYSOUT DD SYSOUT=*,OUTLIM=100                                         00050002
