//FORI05E  JOB ICCTFORI,'JULIEN',CLASS=I,MSGCLASS=I,NOTIFY=&SYSUID      00010000
//STEP1 EXEC PGM=PROG17,TIME=(,1)                                       00020002
//STEPLIB   DD DSN=FORI05.LIB.LOAD,DISP=SHR                             00030000
//DDENTREE  DD DSN=FORI05.SEQ.FENTREE,DISP=SHR                          00040001
//DDFMVT    DD DSN=FORI05.SEQ.FMVT,DISP=SHR                             00050000
//DDANO DD SYSOUT=*                                                     00060000
//SYSPRINT  DD SYSOUT=*                                                 00070000
//SYSOUT    DD SYSOUT=*,OUTLIM=100                                      00080000
